exampleCases/other/Doekemeijer_RenewableEnergy2019/1turb_runs/template_piso_1turb/system/sampling/sliceDataInstantaneous
      sliceDataInstantaneous
      {
          type                 surfaces;
          functionObjectLibs   ("libsampling.so");
          enabled              true;
          interpolationScheme  cell;
          outputControl        adjustableTime;
          writeInterval        5;
          surfaceFormat        vtk;
          fields
          (
              U
          );
          surfaces
          (
              slice_horizontal
              {
                  type         plane;
                  basePoint    (1500.01 1500.01 119.01);
                  normalVector (0 0 1);
                  triangulate  false;
              }
              slice_vertical_x500
              {
                  type         plane;
                  basePoint    (500.01 1500.01 119.01);
                  normalVector (1 0 0);
                  triangulate  false;
              }			
              slice_vertical_x3D
              {
                  type         plane;
                  basePoint    (1534.9 1500.01 119.01);
                  normalVector (1 0 0);
                  triangulate  false;
              }	
              slice_vertical_x5D
              {
                  type         plane;
                  basePoint    (1891.5 1500.01 119.01);
                  normalVector (1 0 0);
                  triangulate  false;
              }			
              slice_vertical_x7D
              {
                  type         plane;
                  basePoint    (2248.1 1500.01 119.01);
                  normalVector (1 0 0);
                  triangulate  false;
              }					  
              slice_vertical_x10D
              {
                  type         plane;
                  basePoint    (2783.0 1500.01 119.01);
                  normalVector (1 0 0);
                  triangulate  false;
              }					  
          );
      }
